/*******************************************************/
/*           Лабораторная  работа №2                   */
/*          Типы данных и ввод-вывод                   */
/*					Вариант №30.					   */
/*******************************************************/
#include <stdio.h>
#include <iostream>
int main() {
	setlocale(LC_ALL, "rus");
	char sur1[15], sur2[] = "", sur3[] = "";
	char name1[] = "", name2[] = "", name3[] = "";
	int year1 = 0, year2 = 0, year3 = 0;
	float sall1 = 0, sall2 = 0, sall3 = 0;
	char a[1000];
	scanf_s("%s",a);
	printf("%s",a);
	/* Введение фактических данных*/
	printf("1. Введите: Фамилию, инициали, год рождения, оклад >");
	//scanf_s("%s %s %d %f", &sur1, &name1, &year1, &sall1);
	//scanf_s("%s", sur1);
	//scanf_s("%s", &name1);
	//scanf_s("%d", &year1);
	//scanf_s("%f", &sall1);
	//printf("2. Введите: Фамилию, инициали, год рождения, оклад >");
	//scanf_s("%s %s %d %f", &sur2, &name2, &year2, &sall2);
	//rintf("3. Введите: Фамилию, инициали, год рождения, оклад >");
	//scanf_s("%s %s %d %f", &sur3, &name3, &year3, &sall3);
	/* Вывод таблицы */
	/* вывод заголовков */
	printf("\n-------------------------------------------------\n");
	printf("|                 Отдел кадров                  |\n");
	printf("|-----------------------------------------------|\n");
	printf("|   Фамилия   | Инициалы | Год рожд. | Оклад($) |\n");
	printf("|-------------|----------|-----------|----------|\n");
	/* вывод строк фактических данных */
	//printf("| %15s | %4s | %4d | %-5.2f |\n", name1, sur1, year1, sall1);
	//printf("| %15s | %4s | %4d | %-5.2f |\n", name2, sur2, year2, sall2);
	//printf("| %15s | %4s | %4d | %-5.2f |\n", name3, sur3, year3, sall3);
	/* вывод примечаний */
	printf("|-----------------------------------------------|\n");
	printf("| Примечание: оклад установлен по состоянию на  |\n");
	printf("| 1 января 2000 года                            |\n");
	printf("-------------------------------------------------\n");
	return 0;
}